Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 但是这件事过后，这个女孩也被各种各样个黑暗势力注意到了，小小年纪就经历了各种意外，后来叶家人学乖了，也不敢炫耀了，把唯一的宝贝女儿藏了起来。
en_us: However, after that incident, various underground forces had also noticed her and paid attention to her. She had experienced all sorts of incidents at a young age, after which the Ye Family learned their lesson and no longer dared to show their daughter off. Instead, they hid their one and only precious daughter.

source: 但是这段时间，这个学生闹的事情确实太多，连带着老师们都被惊动了，她这个导师还跟着被人笑话！
en_us: However, Ye Li had gotten into plenty of trouble lately and even they, the teachers, were alarmed. She was seen as a laughing stock just because she was Ye Li's teacher!

source: 但这也是因为家里人过度的宠溺所致，她又是易胖体质，长得也不高，矮矮胖胖的，同学们都叫她小肥妞。
en_us: However, that was also the reason that her family members spoiled her and overindulged her. She was the type to gain weight easily and was short in stature. Due to the fact that she was short and chubby, her classmates all called her 'fatty'.

source: 但，更多的是震惊。
en_us: However, he felt more astonished than anything.

source: 低头的时候，浓密的睫毛好似蝴蝶翅膀一样，一扇一扇的，好不撩人。
en_us: When she looked down, her dense eyelashes fluttered like the wings of butterflies, making her look extremely alluring.

source: 作为一个女人，叶漓不是傻子。
en_us: As a woman, Ye Li was no fool.

source: 作为在那里购买了九千九百九十万的金牌买家，叶漓如今已近被ys记录在档，是他们品牌重点招待对象。
en_us: As a Gold Member who had spent 14 million dollars on their apparel, Ye Li had already been listed as a VIP of YS Fashion.

source: 你不过是和他读过书而已，我和他相处了整个童年。
en_us: 'You've merely gone to school with him but I spent my entire childhood with him.'

source: 你了解他又如何。
en_us: 'So what if you understand him?'

source: 侍者没有说话，算是默认了她这话的意思。
en_us: The steward's silence was tantamount to agreeing with what Ye Mei said.

source: 便猜测温雅和他的关系。
en_us: Speculations were made about his relationship with Wen Ya.

source: 倒也想看看这个男人如何决定。
en_us: She wanted to see what decision he would make.

source: 倒是奇怪，只是叶漓不想多说，那他也不好多问。
en_us: Although he was puzzled, it would be inappropriate for him to probe further since Ye Li did not want to tell him.

source: 倒是没想到，这个女人这么早就出现了。
en_us: However, she did not expect Wen Ya to appear so soon.

source: 倒是看不出来，虽然欺软怕硬，但是对自己的女儿是真的宠爱。
en_us: Although he liked bullying the weak and was afraid of those who were stronger, he genuinely pampered and loved his daughter.

source: 偏偏他哥哥们就吃这一套。
en_us: Yet, her brothers often fell for it.

source: 偏偏叶漓就拉低了整个班的档次。
en_us: However, Ye Li pulled down the level of her class.

source: 偏偏这样一双魅惑至极的双眼，竟然长在了这样一张圆润的脸蛋上。
en_us: Yet, her beautiful and charming pair eyes were actually matched with her round and chubby face.

source: 光是他们系，学校榜上排名前十的风云人物就有两个，一个叶眉，一个徐晗。
en_us: There were two students from their faculty who made it to the top ten influential figures of the campus. One was Ye Mei, and the other was Xu Han.

source: 光是这样作为，就足以说明不是什么好东西。
en_us: That behavior alone was enough to show that he was not a decent person.

source: 全价九千九百九十九万！
en_us: It was priced at a whopping 14 million dollars!

source: 全程看的网友们一阵尴尬。
en_us: All the netizens felt embarrassed after watching it.

source: 全都是微博的私信和评论。
en_us: She had received plenty of replies and private messages on Twitter.

source: 关于自家女儿的事情，他自然不能忽略。
en_us: Since it concerned his daughter, he naturally couldn't neglect it.

source: 其中一少年手中的手机下意识对上了叶漓的脸，盯着屏幕中的人儿啧啧称赞。
en_us: One of the young men subconsciously pointed the camera of his mobile phone at Ye Li's face, praising her continuously while admiring her beauty.

source: 其中最重要的就是人气粉丝。
en_us: The most important aspect was popularity and having a large number of fans.

source: 其他两个女生看到她竟然要买这限量款的裙子，顿时瞪大了眼睛：“天哪，眉儿你太太有钱了吧，这可要九千多万呢！”
en_us: When the other two girls saw that she was planing to buy that limited edition gown, their eyes widened in shock and she exclaimed, "Oh my god, Ye Mei, you're so rich. This costs 14 million dollars!"

source: 其他两个换好了礼服的女生相继走出，看到她，顿时就惊呼着上前夸赞：“呀！太美了吧！”
en_us: The other two girls who had also changed into the respective gowns that they had chosen, walked out afterwards. When they saw her, they immediately exclaimed and went forth to praise her, "Oh my god! You look beautiful!"

source: 其他人也是一愣。
en_us: The others were stunned too.

source: 其他人闻声，顿时看了过去。
en_us: The others heard the sound and looked over immediately.

source: 其他人闻言，顿时惊讶。
en_us: Everyone got a great shock too.

source: 其他的都是旁系。
en_us: The rest were all distant relatives.

source: 其实订婚这件事本是秘密，可不知被谁透露了出去，以至于同学们嘲笑她小小年纪就要给什么老总当未婚妻。
en_us: Actually, the engagement was originally supposed to be a secret but it somehow got leaked by someone, thus causing her to be ridiculed by her classmates for being the fiancée of a CEO at such a young age.

source: 内容很短，“@小凤漓，给大家介绍一下，我亲妹，叶漓。”
en_us: The content was rather short. "Let me introduce you guys to @LittleYeLi, she's my biological younger sister, Ye Li."

source: 内心深处猛不然就涌出一股热流。
en_us: Deep down, he felt a sudden wave of heat in his heart.

source: 再加上今儿个是自己来找人家麻烦，她就是全责，到时候不是惨了吗？
en_us: Besides, she ought to bear the full responsibility because she had confronted Ye Li by herself. If the police got involved, wouldn't she face dire consequences?

source: 再加上发生了这么大的事情，于向阳心情肯定不好，她自然是不好带外人过来。
en_us: Besides, Yu Xiangyang was definitely displeased because of the major incident. Hence, it would be inappropriate for her to bring them.

source: 再加上叶漓如今身份敏感，又是大明星枫神的妹妹，随便一句话都能上热搜的人，他们这边若是不给人家一个满意的交代，说不定明天就被挂了。
en_us: Besides, Ye Li had a sensitive identity and she was Ye Feng's younger sister. Any word of hers would easily make it to the list of trending searches. If they did not give her a satisfactory explanation, they might be in trouble tomorrow.

source: 再加上她同叶眉从小一起长大，两人关系一直很好，她几乎是对她的话深信不疑。
en_us: Besides, she grew up together with Ye Mei and the two of them had always been the best of friends. She almost never doubted her words.

source: 再看看周围的粉红色的豪华装饰的房间，她愣住了。
en_us: Looking around at the luxuriously decorated room that had pink as its theme color, she was dumbfounded.

source: 再翻开叶漓的微博，看到那条自己梦寐以求的夏夜之星，叶眉的脸色气的铁青！
en_us: She then opened Ye Li's twitter page to see that Ye Li had posted a photo of the Stars of the Summer Night gown. Anger was written all over her face!

source: 再说了，一旁还有两个朋友等着自己付钱呢。
en_us: Besides, her friends were still waiting for her to pay.

source: 再说叶漓这一边，刚上教学楼，就有不少人盯着她的方向看，当然，看得人不是她，是一旁的叶眉。
en_us: On the other hand, as soon as Ye Li entered the teaching building, many people began looking in her direction. Of course, they were not looking at her but Ye Mei.

source: 再说叶眉这边。
en_us: On the other hand, Ye Mei was seated in front of Yu Xiangyang.

source: 再说，因为怕引起骚动，所以叶漓从来不会和他们一起出门。
en_us: Besides, Ye Li would never appear in public with her brothers because she was afraid of causing an uproar.

source: 几个像是老婆子般一直劝导的男人闻声一下就闭了嘴，疑惑的对视一眼，便道：“你这丫头，傻了不成，2020年5月23号啊。”
en_us: The men, who had been persuading her like old long-winded women, immediately fell silent after hearing her words. They looked at each other in bewilderment before saying, "Silly girl, it's the 23rd of May, 2020."

source: 几个兄弟闻言对视一眼，又看了看自家妹妹的粗胳膊短腿，嘴角抽搐了一下。
en_us: Upon hearing his words, the brothers looked at each other before looking at their younger sister's stumpy limbs. Their lips twitched a little.

source: 几个女人看到这一幕，都吓惨了，哪里还敢多说一句，白着小脸灰溜溜的走了。
en_us: The women were frightened out of their wits when they saw that and dared to utter a single word at all. Instead, they left fearfully, their faces turning pale.

source: 几个女人都吓傻了，纷纷倒退了几步，一脸苍白的摇着头：“不，不是这样的徐夫人，您听我们解释，我们不知道叶漓是这个身份。”
en_us: Shocked speechless, the women took a few steps back one after another and shook their heads as they turned pale. "No, that's not what happened, Mrs. Xu, listen to my explanation. We didn't know Ye Li's identity before this."

source: 几个女生吓得一哆嗦，眼泪都出来了：“对，对不起，我们真不知道会是这样....”
en_us: The girls were frightened to the point of shuddering and tearing up. "We're sorry, we really didn't know that this would happen..."

source: 几个女生惶恐极了。
en_us: The girls panicked.

source: 几个少年手一抖，手中的手机差点就掉在了地上。
en_us: The hands of the few young men trembled and they almost dropped their mobile phones.

source: 几乎是人人艳羡的代表人物，男人心中的清纯女神。
en_us: She was almost the subject of everyone's envy and the pure and innocent goddess in the hearts of all the guys.

source: 几人一走，温雅和徐媛的脸色就彻底阴沉了下去。
en_us: After they left, Wen Ya and Xu Yuan's faces turned completely sullen.

source: 几人刚进屋，叶家三兄弟也回来了。
en_us: Shortly after they entered, the three sons of the Ye Family returned too.

source: 几人对视一眼，更为愤怒：“你不认识我们没关系，反正我们认识你就对了，不要脸的贱人，说，你到底是怎么让我们枫神陪你吃饭的，还发了那样的微博，你很嚣张啊，我看你是想死是吗？”
en_us: The few of them looked at each other, and got even angrier. "It's okay if you don't know me. Anyway, I know who you are. You shameless bitch, tell us, just how did you get Ye Feng to have lunch with you? You even tweeted something so atrocious. You're very haughty, aren't you? You've got a death wish, huh?"

source: 几人对视一眼，都从对方眼中看到恼怒：“你别给脸不要脸！”
en_us: When the few of them looked at each other, they could see the anger in each other's eyes. "We're saving you face. Don't go overboard!"

source: 几人想到这里，表情都有些不悦起来。
en_us: At the thought of this, the few of them immediately looked displeased.

source: 几人愣住，随后对视一眼，都从对方眼中看到了相同的担忧之色，戴着眼镜穿着白衬衫十分精明的男人严肃的开口：“你这是说什么傻话，你怎么可能会死呢？”
en_us: The few men were stunned, after which they looked at each other and saw the looks of worry in one another's eyes. The smart man who was wearing glasses and a white shirt chastised sternly, "What silly things are you saying? How can you be dead?"

source: 几人抬起的脚在空中一顿。
en_us: The few of them paused in their tracks, their legs in midair.

source: 几人点了点头，跟了上去。
en_us: The few of them nodded and followed her.

source: 几人的瞳孔一深。
en_us: Their pupils darkened again.

source: 几人还没反应过来，一道阴沉的男声就从他们身后响起：“你们在干什么！”
en_us: Before they could even react, a low and gloomy male voice sounded from behind them. "What are you people doing!?!"

source: 凭什么叶漓能够参加这种高档聚会，自己却要在家坐着。
en_us: 'Why must I stay at home while Ye Li gets to attend such a high-class social gathering?'

source: 凭什么叶漓这么差劲的人都能得到他的宠爱，而自己不能?
en_us: 'Why can such a lousy person like Ye Li win his heart but I can't?'

source: 凭什么啊！到底凭什么，明明都是有血缘关系的，自己和她的待遇却是天差地别！
en_us: 'Why!?! Just why am I treated so differently from her even though we're all related by blood!?!'

source: 出乎意料的合身。
en_us: To her surprise, it fit her rather well.

source: 刚刚他们那个举动，无疑得罪了人。
en_us: They had undoubtedly offended her just now.

source: 刚刚看到的时候，先是有些惊讶，然后就是惊喜开心。
en_us: When she saw them, she was first astonished, before feeling delighted.

source: 刚刚自己没听错的话，这个女孩叫了凤年哥哥几个字？
en_us: 'If I heard correctly, this girl mentioned Xu Fengnian's name.'

source: 刚刚还听到她叫哥哥，难不成这女孩就是传说中的叶家那位小公主？
en_us: They had also heard her calling them her brothers. Could it be that she's the little princess of the Ye Family?

source: 刚刚还对她们大打出手的叶漓，突然就扑进了男人的怀中，“老公，她们欺负我！”
en_us: Ye Li, who had just been trying to attack them, suddenly leaped into his arms and exclaimed, "Hubby, they're bullying me!"

source: 刚回学校，就被程艳阴沉着脸叫去了办公室。
en_us: As soon as she returned to school, Cheng Yan called her to the office with a gloomy expression.

source: 刚要说什么，一旁的王丽忍不住先开口了：“你不是废话吗？这学校的大明星除了咱们一心向阳还有谁，你不会以为是请你吃饭的人包的场吧，哈哈，真的是笑死我了，你知道鱼庄包场要多少钱吗？”
en_us: Just as she was going to say something, Wang Li, who was beside her, couldn't help but interject, "Aren't you asking a redundant question? The only celebrity who goes to our school is Xiangyang. Surely you don't think that the person who asked you out for lunch is the one who booked the restaurant, do you? Haha, what a joke. Do you know how much it costs to book the entire fish restaurant?"

source: 刚转身准备走，就听见两个女生阴沉的声音。
en_us: Just as she turned around and was ready to leave, she heard the low and sinister voices of two girls.

source: 别说关注了，这餐桌上的人，几乎没有人将目光落到过她的身上。
en_us: Almost no one at the dining table even looked at her, let alone pay attention to her.

source: 别说是外人，就连叶眉也是一脸惊愕的看着叶漓。
en_us: Even Ye Mei was looking at Ye Li in exasperation, let alone the outsiders.

source: 到了最后才明白，年纪轻轻就出了意外的哥哥们，才是真正关心她的人。
en_us: She only realized in the end that her brothers who had gotten into an accident at a young age, were the ones who really cared about her.

source: 到了最后，才狠狠反击！
en_us: She launched a fierce retaliation at the end!

source: 到底发生了什么，叶漓怎么又变成了这样。
en_us: 'What exactly happened? Why did Ye Li become like this?'

source: 到底是何方神圣给他们总裁大人发消息啊，竟然能让雷厉风行的大总裁发呆。
en_us: 'Who sent the CEO a message? He or she actually managed to make the austere and domineering CEO space out.'

source: 到时候他会怎么想？
en_us: If she were to do that, what would he think of her?

source: 到时候可能会举办一场文艺汇演，但是这件事却是保密的，就是为了考验学生们的急场应付能力。
en_us: The entertainment company would probably hold a cultural arts performance when the time comes but the matter was kept confidential for the sake of testing the students' ability to cope with an impromptu situation.

source: 到时候就已经不是他们两人之间的事情，而是已经上升到了两个家族之间的恩怨。
en_us: By then, it would no longer be just a matter between the two of them. It would turn into a feud between the two families.

source: 到时候就算是惊动了徐家的人，他们只要将所有的错推到她的身上，谁又知道？
en_us: Even if the Xu Family was alarmed, they could just put the blame on Ye Li. Who would know?

source: 前段时间大家就听说徐家和叶家有可能要结亲了。
en_us: Previously, everyone had already heard that the Xu Family and Ye Family were going to unite over a marriage between their children.

source: 前段时间她跳河自杀一事，闹的沸沸扬扬。
en_us: Previously, she caused an uproar when she tried to commit suicide by jumping into the river.

source: 前面开车的司机看到自家总裁这幅失态的场面，愣住了，反应过来的他赶忙追了上去。
en_us: The chauffeur froze when he saw his CEO acting out of the ordinary. After being stunned, he reacted and quickly chased after Xu Fengnian.

source: 前面憨厚的司机到这话，还好奇的从后视镜看了叶漓一眼，随后笑着夸赞：“我也觉得挺好看的，精神。”
en_us: When the daft chauffeur in front heard those words, he even curiously looked at Ye Li from the rearview mirror, then smiled and praised, "I think you look great too. You look much more energetic."

source: 剩下的同学们都是一副惊魂未定的表情，甚至于大部分都不敢去看叶漓的目光，生怕被她注意到。
en_us: The rest of the students were all in a state of shock, even to the point that most of them did not dare to look at Ye Li's eyes, for fear that she would notice them.

source: 办公室一度陷入了寂静，只有孟非掩饰不住的抽泣声。
en_us: At one point, the office fell silent and only Meng Fei's weeping could be heard.

source: 动作好似一个小孩。
en_us: Her actions were like that of a child's.

source: 势必是那两人先欺负了她，忍无可忍才动了手。
en_us: He reckoned that the two girls must have bullied her first and she only retaliated because she couldn't stand it.

source: 印象中的叶漓就是土肥圆的丑八怪。
en_us: In his memory, Ye Li was just a chubby, tacky and ugly girl.

source: 印象中的叶漓，向来都是低着头，只对人露出一个下巴。
en_us: In her memory, Ye Li had always hung her head low and would only reveal her chin to others.

source: 即使大家知道不好接触，但是越是这样难以攻略的人，越是有人愿意飞蛾扑火。
en_us: Even though everyone knew that it was hard to get along with him, the harder he was to conquer, the more they were willing to try.

source: 即使是看着网上那么多人都在黑她骂她，可叶眉依旧笑不出来。
en_us: Ye Mei could not bring herself to smile, despite seeing that a large number of netizens were scolding Ye Li on the Internet.

source: 即使身材微胖，也并没有拉低她的颜值。
en_us: Even though she was chubby, it did not affect her beauty.

source: 却不知道，他向来靠的，都是那些被他表面所欺骗的富二代，一步步的被人捧上来的高度。
en_us: However, they did not know that he had always been relying on the wealthy heirs who were fooled by his appearance, to attain the fame that he had.

source: 却从没有人叫过她一声二小姐。
en_us: However, no one had ever addressed her as 'Second Missy'.

source: 却怎么也没想到，叶眉竟然是小三的女儿！
en_us: He did not expect Ye Mei to be the daughter of a mistress!

source: 却没想到，刚进来，就听到了叶眉的话。
en_us: He did not expect to hear those words from Ye Mei as soon as he entered.

source: 却没想到，这样一个表面看起来文质彬彬的少年，背地里竟然那样欺负自家妹妹。
en_us: However, he did not expect that the young man who looked civilized and courteous on the surface, would secretly bully his younger sister behind his back.

source: 却见一穿着西装的男人，正坐在叶漓身边，一手搭在叶漓身后的沙发上，仿佛在宣誓那是他的所有物，一双深不可见的黑眸，正以一种俯视的姿态冷冷的盯着他。
en_us: He saw a man in a suit seated right beside Ye Li, with one hand on the couch behind her, as if he was declaring sovereignty. He was glaring at Yu Xiangyang coldly with his pair of dark, deep eyes.

source: 却见女儿一副无所谓的表情，“爸爸，都已经过了，我现在已经不在乎了，你别生气，我知道我不是人民币，做不到人人喜欢，以后我也不会犯傻了。”
en_us: However, he realized that Ye Li did not seem bothered at all. "Father, it's all in the past. I don't care anymore. Don't be angry, I know I'm not money and I can't make everyone happy. From now on, I won't be silly anymore."

source: 压根就忘了，人家刚来时，他们的态度。
en_us: They had completely forgotten about the attitudes that they showed when Ye Li had just walked over.

source: 原本只是听说，还不确定。
en_us: The marriage was initially yet to be confirmed.

source: 原本吵闹的教室一瞬间像是失去了声音。
en_us: The boisterous classroom immediately fell silent.

source: 原本她还不知道怎么教训叶漓的。
en_us: She initially did not know how to teach Ye Li a lesson.

source: 原本对于自家弟弟这个朋友，他是一直以礼相待。
en_us: He initially treated Yu Xiangyang cordially like he was his younger brother.

source: 原本快两百万粉丝的她，突然就掉了好几十万。
en_us: Ye Mei, who initially had almost 2 million followers, suddenly lost hundreds of thousands of them.

source: 原本才二十个粉丝的她，就这一会的功夫，就多了好几万。
en_us: She initially only had 20-odd fans but in the blink of an eye, she now had tens of thousands of them.

source: 原本气势汹汹的程艳听到这话，脸色刷的一变，不可置信的看着她：“你，你什么意思，我听不懂你说什么！”
en_us: The expression of Cheng Yan, who was initially very aggressive, changed immediately after hearing his words. He looked at her in disbelief and exclaimed, "You... What do you mean? I don't understand what you said!"

source: 原本的骂声逐渐变成了抱歉。
en_us: The scoldings, hateful comments and criticism gradually turned into apologies.

source: 原本看着一群女生要欺负她的时候，他还十分生气的。
en_us: He was extremely infuriated when he saw the girls who were about to bully her.

source: 原本脸色不大好的她一下看起来就精致了不少，薄薄的刘海儿隐约露出她细长的眉毛，微微上挑的眼尾硬生生的给这张脸增添了几分诱惑，特别是眼角下还有一颗泪痣。
en_us: Ye Li, who originally looked sickly, now looked much more exquisite than before. Her thin bangs revealed her long and thin eyebrows, and the slightly upturned corners of her eyes made her look attractive, especially with the mole under the corner of the eye.

source: 原本还有些害怕的他因为妹妹的话，这会儿腰杆子都直了。
en_us: Initially, he was afraid but he was extremely confident after hearing Ye Li's reassuring words.

source: 原来不是乱说，而是真的。
en_us: It turned out that Ye Li was really not spouting any nonsense but stating facts.

source: 原来他们之间是这样的关系。
en_us: It turned out that they were siblings.

source: 原来如此，原来如此。
en_us: So that's what happened.

source: 原来是要带叶小姐去吃饭呀。
en_us: 'Turns out he wants to take Miss Ye out for a meal."

source: 去刷卡的服务员走了过来，脸色却不太好看。
en_us: The sales assistant who had gone to process the payment with her card, walked over with a sullen expression.

source: 参加这个聚会的人，都是要有邀请函才能进去的，为了的就是杜绝一些乱七八糟的人混进去。
en_us: Only those who had invitations could enter the gathering venue, so as to prevent any dubious people from sneaking in.

source: 又a又飒！
en_us: It was suave!

source: 又动了什么歪心思？
en_us: 'Is she harboring some thoughts?'

source: 又听叶漓这么一说，都惊愕的说不出话。
en_us: After hearing Ye Li's words, they were stunned beyond words.

source: 反倒是周围的女孩子们，眼珠子都快黏在了他身上似的。
en_us: On the other hand, the girls around him almost had their eyes glued onto him.

source: 反倒是，更像仇人....
en_us: In fact, she seemed to be staring at her enemy...

source: 反应过来的她做出一副害怕的表情，委屈的道：“不是的阿漓姐姐，我也是为了你好才这么说，你怎么能这么凶我？”
en_us: After recovering from the shock, she put on a fearful expression and asked aggrievedly, "Sister Li, I was just saying this for your best interests. How can you be so fierce to me?"

source: 反应过来顿时坐直了身子，指着自己有些凌乱的头发丝，严肃且认真的回答：“有事，她们揪我头发！”
en_us: When she recovered from the shock, she immediately sat up straight and pointed at her messy hair before answering solemnly, "I'm not fine, they yanked at my hair!"

source: 发生了这样的意外，是两人都没想到的。
en_us: Neither of them expected that to happen.

source: 发生了这种事情，看当时导师那表情，叶漓不被找麻烦才怪。
en_us: 'Judging from the severity of the incident and the expression and the expression on the teacher's face at that time, Ye Li must have gotten into trouble.'

source: 口上劝着叶眉，可看向叶漓的目光中，尽是幸灾乐祸！
en_us: Although they were persuading Ye Mei, they were looking at Ye Li gloatingly!

source: 口上这么说着，手却已经打开了美颜相机，笑道：“咱们合拍一张照片吧，难得相聚一次。”
en_us: Despite saying so, she had already turned on the beauty camera app on her mobile phone and she said smilingly, "Let's take a picture together. It's rare for us to meet."

source: 口中夸赞的十句不离叶漓。
en_us: He would often praise Ye Li.

source: 另一个女生故作生气的说：“好呀，眉儿你偏心！”
en_us: Pretending to be angry, another girl jested, "Ye Mei, you're so biased!"

source: 另一个满脸淤青，头发凌乱的女孩瑟瑟发抖的瘫在另一边，惊恐的看着这一幕。
en_us: The other girl's face was covered in bruises and the one with messy hair fell to the side while shivering, looking at the scene before her in horror.

source: 另一辆被神秘人所拍。
en_us: The other was purchased by a mysterious person.

source: 另一边，叶眉跟着早先就约好一起去徐家参加聚会的几个小姐来到了ys品牌店。
en_us: On the other hand, Ye Mei headed to a store of a luxury fashion label together with a few heiresses of other wealthy families. They had agreed to go to the gathering together, prior to this.

source: 另一边，完全不知道自己打扰了人家开会的叶漓已经背上了自己的书包下了楼。
en_us: On the other hand, Ye Li, who was completely unaware that she had just disrupted the meeting, had already gone downstairs with her schoolbag.

source: 另一边，帝国集团会议室中。
en_us: On the other hand, there was an oppressive tension in the air of the conference room of Empire Group conglomerate at this moment.

source: 另一边，帝都最中心繁华地段，装修带着几分古风的御食坊楼下，一辆黑色豪车缓缓停下。
en_us: On the other hand, a black luxury car slowly pulled over in the central bustling district of Beijing, right below Imperial Restaurant that had an ancient style.

source: 另一边，正在工作的叶洛接到了手下打来的电话。
en_us: On the other hand, Ye Luo, who was working, received a call from his subordinate.

source: 只剩下了一群年轻人。
en_us: The bunch of young people were left behind.

source: 只剩下了开心和温暖。
en_us: She was filled with joy and warmth.

source: 只可惜这徐晗来上课那是看心情。
en_us: Unfortunately, Xu Han would decide whether to turn up for class or not, depending on his mood.

source: 只恨自己瞎了眼，一心只相信叶眉和于向阳这对渣男贱女的话，以至于最后被害到了那样的下场！
en_us: She could only blame herself for being blind and believing Yu Xiangyang and Ye Mei, the despicable couple who caused her to end up in that terrible situation!

source: 只是不同的是，徐凤年没有让叶眉得逞过。
en_us: However, the difference was that Xu Fengnian had never let Ye Mei gotten what she wanted.

source: 只是不知道，你这个位置还能坐多久呢？
en_us: 'But how long can you be in this position for?'

source: 只是今天这三兄弟的表情有些奇怪，让她摸不着头脑。
en_us: However, her three brothers had strange expressions today which confused her.

source: 只是他们的目光从叶眉身上扫过之后，都好奇的落到了叶漓身上，见是一张陌生人的脸，纷纷疑惑：“那人是谁啊，艺术系又来新人了吗？”
en_us: However, after looking away from Ye Mei, they glanced at Ye Li curiously. Feeling bewildered by the fresh face, she asked, "Who's that person? Is there a new student in the Faculty of Arts?"

source: 只是听这些人所说，想必那叫枫神的男人特别的火。
en_us: However, she reckoned that Ye Feng was definitely very famous.

source: 只是奈何叶眉出来帮忙，那些人才不好对她动手。
en_us: However, Ye Mei stood up to help her, so those people found it inappropriate to hit her.

source: 只是孩子长大了，就不爱来了，以往过来，也是一副沉默寡言的模样，让她很是心疼。
en_us: However, after Ye Li grew up, she rarely visited the Xu Family and even when she came over, she would be quiet and indifferent, which truly broke Mrs. Xu's heart.

source: 只是很久没玩了，若不是所有自己所有账号的密码都一样，她恐怕都记不得了。
en_us: However, she had not used it in a long time. If not for the fact that all her accounts were locked with the same password, she would have probably forgotten it.

source: 只是徐媛毕业了，她还才上大一，这次要不是看到她，都不知道她回来了。
en_us: However, Xu Yuan had already graduated while she was Xu Qian was only a freshman-to-be. If she did not see Xu Yuan here, she wouldn't have known about her return.
